In [1]:
import sqlite3
import pandas as pd

In [2]:
feature_id = 986
feature_region_peak_id = 1
db_name = '/home/ubuntu/UPS2_DIA_180907-features-{}-{}.sqlite'.format(feature_id, feature_id)
conv_db_name = '/home/ubuntu/UPS2_DIA_180907/UPS2_DIA_180907.sqlite'

In [3]:
# get all the points in the feature's summed ms1 region for this peak
db_conn = sqlite3.connect(db_name)
ms1_peak_points_df = pd.read_sql_query("select feature_id,point_id from summed_ms1_regions where feature_id={} and peak_id={}".format(feature_id, feature_region_peak_id), db_conn)
db_conn.close()

In [4]:
ms1_peak_points_df.head()

   feature_id  point_id
0         986         1
1         986         3
2         986         5
3         986         7
4         986         9

In [5]:
# get the mapping from feature points to summed frame points
db_conn = sqlite3.connect(db_name)
ms1_feature_frame_join_df = pd.read_sql_query("select * from ms1_feature_frame_join where feature_id={}".format(feature_id), db_conn)
db_conn.close()

In [6]:
ms1_feature_frame_join_df.head()

   feature_id  feature_point_id  frame_id  frame_point_id
0         986                 1      2890            9284
1         986                 2      2890            9288
2         986                 3      2890            9394
3         986                 4      2890            9397
4         986                 5      2890            9508

In [11]:
# get the summed to raw point mapping
db_conn = sqlite3.connect(conv_db_name)
raw_point_ids_df = pd.read_sql_query("select * from raw_summed_join limit 100", db_conn)
db_conn.close()

In [12]:
raw_point_ids_df.head()

   summed_frame_id  summed_point_id  raw_frame_id  raw_point_id
0                1                1             1            62
1                1                1             4           111
2                1                1             4           112
3                1                1             6            98
4                1                2             4           110

In [17]:
raw_point_ids_df['summed_frame_point'] = raw_point_ids_df['summed_frame_id'].map(str) + '|' + raw_point_ids_df['summed_point_id'].map(str)
raw_point_ids_df['raw_frame_point'] = raw_point_ids_df['raw_frame_id'].map(str) + '|' + raw_point_ids_df['raw_point_id'].map(str)

In [18]:
raw_point_ids_df.head()

,summed_frame_id,summed_point_id,raw_frame_id,raw_point_id,summed_frame_point,raw_frame_point
0,1,1,1,62,1|1,1|62
1,1,1,4,111,1|1,4|111
2,1,1,4,112,1|1,4|112
3,1,1,6,98,1|1,6|98
4,1,2,4,110,1|2,4|110